# Pandas Exercises

We will be working with a Dataset from the [Internet Movie Database](https://www.imdb.com). The dataset comes from [Kaggle](https://www.kaggle.com/PromptCloudHQ/imdb-data/data). Since you need an account there to download, the datafile is provided in ILIAS for your convenience. The copied file was slightly altered to make this exercise more interesting.

Import Numpy and Pandas with the usual convention

In [2]:
import numpy as np
import pandas as pd

Load the file into a Dataframe named df.

In [3]:
# df = ...

In [4]:
df = pd.read_csv('IMDB-Movie-Data.csv')

Show the dimensions (the shape) of the dataframe

In [5]:
df.shape

(1000, 12)

Now display the fist 10 rows of the dataframe

In [6]:
df.head(n=10)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
5,6,The Great Wall,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.13,42.0
6,7,La La Land,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.06,93.0
7,8,Mindhorn,Comedy,A has-been actor best known for playing the ti...,Sean Foley,"Essie Davis, Andrea Riseborough, Julian Barrat...",2016,89,6.4,2490,NaN,71.0
8,9,The Lost City of Z,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.01,78.0
9,10,Passengers,"Adventure,Drama,Romance",A spacecraft traveling to a distant colony pla...,Morten Tyldum,"Jennifer Lawrence, Chris Pratt, Michael Sheen,...",2016,116,7.0,192177,100.01,41.0

Also check the last 5 entries.

In [7]:
df.tail()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

That last line does not contain any data. Remove it.

In [8]:
# any of the following works (but execute only one of them)
df = df.iloc[:-1, :] # select all rows except the last by position
#df = df.loc[:999, :] # select all rows except the last by index
#df.drop(1000, axis='index', inplace=True) # drop last row inplace
#df = df.drop(1000) # drop last row and assign resulting dataframe to df

List all the columns of the DataFrame

In [9]:
df.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

And now list the index

In [10]:
df.index

RangeIndex(start=0, stop=999, step=1)

List only the Years

In [11]:
df.Year # or df['Year'] or df.loc[:, 'Year']

0      2014
1      2012
2      2016
3      2016
4      2016
       ...
994    2012
995    2015
996    2007
997    2008
998    2014
Name: Year, Length: 999, dtype: int64

What is the time our data spans?

In [12]:
df.Year.min(), df.Year.max()

(2006, 2016)

Now check if the datatypes make sense (list them)

In [13]:
df.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In fact, we can drop the Rank column, as it simply is a sort of Id which we don't need.

In [14]:
df.drop('Rank', axis='columns', inplace=True)

In [15]:
df.head()

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

Ok. So the columns Genre and Actors contain multiple values. Just like with databases, we want our dataframe to adhere to the [1st Normal Form](https://en.wikipedia.org/wiki/First_normal_form) and thus need to separate these columns into their own Dataframes or Series.

First use the .str accessor and its split() method to create a Series where each element is a list of genres.

In [16]:
# genres = ...
# genres.head()

In [17]:
genres = df.Genre.str.split(',')
genres.head()

0     [Action, Adventure, Sci-Fi]
1    [Adventure, Mystery, Sci-Fi]
2              [Horror, Thriller]
3     [Animation, Comedy, Family]
4    [Action, Adventure, Fantasy]
Name: Genre, dtype: object

You now have a Series of lists. The following code generates a mapping table that has one entry per movie/genre combination. Try to understand the statement by taking it apart, executing the commands one-by-one and reading their documentation.

In [18]:
genres = genres.apply(pd.Series).stack().reset_index().iloc[:, [0,2]]
genres.columns = ['movie_id', 'genre']
genres.head()

   movie_id      genre
0         0     Action
1         0  Adventure
2         0     Sci-Fi
3         1  Adventure
4         1    Mystery

Now do the same for the actors.

In [19]:
actors = df.Actors.str.split(',').apply(pd.Series).stack().reset_index().iloc[:, [0,2]]
actors.columns = ['movie_id', 'actor']
actors.head()

   movie_id            actor
0         0      Chris Pratt
1         0       Vin Diesel
2         0   Bradley Cooper
3         0      Zoe Saldana
4         1     Noomi Rapace

We don't need the original columns Genre and Actors from the df DataFramwe anymore. Drop them.

In [20]:
df.drop(['Genre', 'Actors'], axis=1, inplace=True)

Ok, so now our three DataFrames are ready for some analysis!

In [21]:
df.head(n=3)

,Title,Description,Director,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,Guardians of the Galaxy,A group of intergalactic criminals are forced ...,James Gunn,2014,121,8.1,757074,333.13,76.0
1,Prometheus,"Following clues to the origin of mankind, a te...",Ridley Scott,2012,124,7.0,485820,126.46,65.0
2,Split,Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,2016,117,7.3,157606,138.12,62.0

In [22]:
actors.head(n=3)

   movie_id            actor
0         0      Chris Pratt
1         0       Vin Diesel
2         0   Bradley Cooper

In [23]:
genres.head(n=3)

   movie_id      genre
0         0     Action
1         0  Adventure
2         0     Sci-Fi

Which are the movies with the longest and shortest runtime?

In [24]:
# which boolean indexing (can also be written in one line):
shortest_runtime = df['Runtime (Minutes)'].min()
df[df['Runtime (Minutes)'] == shortest_runtime]

,Title,Description,Director,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
793,Ma vie de Courgette,"After losing his mother, a young boy is sent t...",Claude Barras,2016,66,7.8,4370,0.29,85.0

In [25]:
# with sorting:
df.sort_values(by='Runtime (Minutes)', ascending=False).head(n=1)

,Title,Description,Director,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
828,Grindhouse,Quentin Tarantino and Robert Rodriguez's homag...,Robert Rodriguez,2007,191,7.6,160350,25.03,NaN

Which is the best movie, measured by the metascore?

In [26]:
df.sort_values(by='Metascore', ascending=False).head(n=1)

,Title,Description,Director,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
656,Boyhood,"The life of Mason, from early childhood to his...",Richard Linklater,2014,165,7.9,286722,25.36,100.0

Which is the longest description?

In [27]:
index_of_longest = df.Description.str.len().sort_values(ascending=False).head(n=1)
df.loc[index_of_longest.index, 'Description'].values

# Alternative solution
# df.loc[df.Description.str.len().idxmax].Description

array(["In London, a real-estate scam puts millions of pounds up for grabs, attracting some of the city's scrappiest tough guys and its more established underworld types, all of whom are looking to get rich quick. While the city's seasoned criminals vie for the cash, an unexpected player -- a drugged-out rock 'n' roller presumed to be dead but very much alive -- has a multi-million-dollar prize fall into... See full summary »"],
      dtype=object)

What is the average metascore?

In [28]:
df.Metascore.mean()

59.03636363636364

Sort the genres by popularity.

In [29]:
genres.genre.value_counts()
# or manually: genres.groupby('genre').count().sort_values('movie_id', ascending=False)

Drama        513
Action       303
Comedy       278
Adventure    259
Thriller     195
Crime        150
Romance      141
Sci-Fi       120
Horror       119
Mystery      106
Fantasy      100
Biography     81
Family        50
Animation     49
History       29
Sport         18
Music         16
War           13
Western        7
Musical        5
Name: genre, dtype: int64

Which director is the most productive by number of movies?

In [30]:
df.Director.value_counts().head()

Ridley Scott          8
David Yates           6
M. Night Shyamalan    6
Paul W.S. Anderson    6
Michael Bay           6
Name: Director, dtype: int64

Which director is the most productive by revenue?

In [31]:
df.groupby('Director')['Revenue (Millions)'].sum().sort_values(ascending=False).head()

Director
J.J. Abrams          1683.45
David Yates          1630.51
Christopher Nolan    1515.09
Michael Bay          1421.32
Francis Lawrence     1299.81
Name: Revenue (Millions), dtype: float64

Which actors have acted most often in the year 2012?

In [32]:
joined = actors.join(df, on='movie_id')
joined.loc[joined.Year==2012, 'actor'].value_counts().head()

 Rosamund Pike      2
 Anne Hathaway      2
 John Goodman       2
 Liam Hemsworth     2
 Josh Hutcherson    2
Name: actor, dtype: int64

Make sure you remember the function value_counts(), you'll use it a lot!

Now, explore the dataset a bit more and think of some questions you can answer.

In [33]:
# ...

### Well done!
If you understood most of the concepts, you are ready for the Machine Learning course.

Below is some additional material, if you want to go on.
* [Pythonchallenge](http://www.pythonchallenge.com/): Learn Python by solving increasingly hard riddles. Fun!
* [Project Euler](https://projecteuler.net/): Learn Python by solving increasingly hard programming problems.
* [More Pandas Exercises](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) (see the Cookbook exercises)
* [More Python Exercises](https://github.com/jerry-git/learn-python3) (these start out easy but cover a lot of the language)